  document.addEventListener('DOMContentLoaded', function() {
            var typingTimer;
            var doneTypingInterval = 100;
            var $inuk = document.getElementById("inuk");
            var $braille = document.getElementById("braille");
            var wordsWritten = []; // قائمة تخزين الكلمات المكتوبة

            var inukKey = {
                "مرحبا": ["باشي", ""],
                "كيف حالك": ["حالي طا", ""],
                "توجد": ["هيا", ""],
                "ماذا": ["جي", ""],
                "عن": ["سر", ""],
                "عنهم": ["سروانرا", ""],
                "تعرف": ["طي زاني", ""],
                "عرف": ["زاني", ""],
               
               
               
                   "قال": ["كوت", ""],
                    "عالم": ["عالم", "خلگ"],
                    "لا": ["نه", ""],
                    "تعرف": ["زاني", ""],
                    "يعرف": ["زاني", ""],
                    "عرف": ["زان", ""],
                    "عرفت": ["زان", ""],
                    "عرفو": ["زانن", ""],
                    "يمكنني": ["كارم", ""],
                    "هل": ["قاي", ""],
                    "الله": ["خودى", ""],
                    "دخل": ["درباس", ""],
                    "غالي": ["بهايا", ""],
                    "خير": ["خير", ""],
                    "شر": ["شر", ""],
                    "قتل": ["گوشط", ""],
                    "على": ["سر", ""],
                    "عين": ["جاف", ""],
                    "عيني": ["جافا", ""],
             
                    "عيون": ["جاف", ""],
                    "عيوني": ["جافيمن", ""],
                    "اخ": ["برا", ""],
                    "اخي": ["برايمن", ""],
                    "اخوي": ["براكيمن", ""],
                    "خيو": ["براكو", ""],
                    "تم": ["بو", ""],
                    "موافق": ["دي باشا", ""],
                    "حب": ["كيف", ""],
                    "حبيته": ["كيفا من هاتي", ""],
                    "ابرة": ["درزي", ""],
                    "الخالق": ["ايزدان", ""],
                    "انت": ["طي", ""],
                    "انا": ["از", ""],
                    "هو": ["او", ""],
                    "نحن": ["ام", ""],
                    "هم": ["او", ""],
                    "اعرف": ["زانم", ""],
              "شيء": ["تشطي", ""],
                    "شي": ["تشطي", ""],
                    "الذي": ["اي از", ""],
                    "من": ["كي", ""],
                    "بسم": ["بنافي", ""],
                    "اسم": ["نافي", ""],
                    "اسماء": ["ناف", ""],
                    "رمان": ["هنار", ""],
                    "رمانات": ["هنارن", ""],
                    "لكي": ["شبر", ""],
                    "أن": ["وو", ""],
                    "كبير": ["مزن", ""],
                    "رحمن": ["دلوفان", ""],
                    "الرحمن": ["دلوفان", ""],
                    "رحيم": [" ى مهربان", ""],
                    "اليد": ["دست", ""],
                    "عاش": ["ساغبو", ""],
                    "يعيش": ["ساغدبي", ""],
                    "تعيش": ["ساغبي", ""],
                    "مؤخرة": ["قون", ""],
                    "طيز": ["قون", ""],
                    "قضيب": ["گيير", ""],
                    "قضيبي": ["گيري مين", ""],
                    "لكن": ["اوه", ""],
                    "تعال": ["ورا", ""],
                    "يحبك": ["خوش دفيي", ""],
                    "تحبك": ["طي خوش دفيي", ""],
                    "احبك": ["حش طادكم", ""],
                    "عزيزي": ["عزيزي", ""],
                    "كان": ["بري", ""],
                    "يحبنا": ["حش مادكا", ""],
                    "كس": ["قوز", ""],
                    "قول": ["بيشا", ""],
                    "هكذا": ["وسا", ""],
                    "هذا": ["وسا", ""],
                    "هذه": ["وها", ""],
                    "يا": ["يا", ""],
                    "يعني": ["يعني", ""],
                 "تحبنا": ["حش مادكي", ""],
                    "شيخ": ["شيخ", ""],
                    "شيخي": ["شيخيما", ""],
                    "العاقل": ["ايشهرزا", ""],
                    "العرب": ["عربوك", ""],
                    "الاكراد": ["كورد", ""],
                    "كورد": ["كورد", ""],
                    "قصص": ["قصيت", ""],
                    "حقيقة": ["حقيقي", ""],
                    "نتعلم": ["علمنيتي", ""],
                    "علم": ["علم", ""],
                    "طرق": ["ريك", ""],
                    "000": ["000", ""],
                    "000": ["000", ""],
                    "000": ["000", ""],
                    "000": ["000", ""],
                    "000": ["000", ""],
                    "000": ["000", ""],
                    "000": ["000", ""],
                 
                
                
                
                
                
                
                 
                
                
                   
                
                
                
                
                
                
                
                
                "كيف": ["جاوا", ""],
                // الكلمات الجديدة...
            };

            $inuk.addEventListener('keyup', function() {
                clearTimeout(typingTimer);
                typingTimer = setTimeout(inukFunction, doneTypingInterval);
            });

            function inukFunction() {
                var inuk = $inuk.value.toLowerCase();
                var words = inuk.split(/\s+/); // تقسيم النص إلى كلمات بمسافة
                var result = "";

                for (var i = 0; i < words.length; i++) {
                    var word = words[i];

                    // التحقق من عدم تكرار الكلمة في القائمة
                    if (!wordsWritten.includes(word)) {
                        wordsWritten.push(word); // إضافة الكلمة إلى القائمة
                    }

                    for (var key in inukKey) {
                        if (inukKey.hasOwnProperty(key)) {
                            if (word === key) { // بحث عن الكلمة المطابقة
                                result += inukKey[key][0] + " " + inukKey[key][1] + " ";
                                break;
                            }
                        }
                    }
                }

                $braille.value = result.trim();
            }
        });
